## 0630 수업 메모

##  DataFrame

판다스 데이터 프레임은 리스트도 사용은 하지만 왠만하면 딕셔너리 

열이름을 key로 하고 리스트를 value로 갖는 딕셔너리로 정의

In [2]:
import pandas as pd

In [4]:
dict_data =  {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],'c':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
print(df)

   c0  c1  c2   c  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [55]:
df = pd.DataFrame([[15,'남','덕영중'], [17,'여','수리중']], 
                 index = ['준서','예은'], #행
                 columns=['나이','성별','학교']) #열
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [37]:
df.rename(columns={'나이':'연령'}) #행,열 이름 바꾸기 / inplace = T 는 대체되어 저장

    연령  성별   학교
준서  15   남  덕영중
예은  17  ,여  수리중

* 모르는 패키지(모듈)은 Help 들어가서 직접 찾아보고 공부하기

In [40]:
df.drop('나이',axis = 1)

    성별   학교
준서   남  덕영중
예은  ,여  수리중

In [41]:
df

    나이  성별   학교
준서  15   남  덕영중
예은  17  ,여  수리중

In [42]:
df['나이'] # 행은 안되지만 열은 된다!

준서    15
예은    17
Name: 나이, dtype: int64

In [49]:
df.loc(1) #iloc은 index -행 (정수형 위치)

[]는 위치값
()클래스 안 함수 사용할 때

In [58]:
df['평균'] = 0

In [59]:
df.loc['길동'] = [26, '남', '광산중', 100]

In [64]:
print(df)
print('\n')
df.T

    나이 성별   학교   평균
준서  15  남  덕영중    0
예은  17  여  수리중    0
길동  26  남  광산중  100

     준서   예은   길동
나이   15   17   26
성별    남    여    남
학교  덕영중  수리중  광산중
평균    0    0  100

In [3]:
exam_data = {'수학' : [90, 80, 70],
            '영어' : [98,89,95],
            '음악' : [85, 95,100],
            '체육' : [100,90,90]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

df['총점'] = df['수학'] +df['영어'] +df['음악'] +df['체육']
df['평균'] = df['총점']/4

df

    수학  영어   음악   체육   총점     평균
서준  90  98   85  100  373  93.25
우현  80  89   95   90  354  88.50
인아  70  95  100   90  355  88.75

In [66]:
for row in df['평균']:
    print(row)

93.25
88.5
88.75

In [86]:
# 처음 만든것
# for i in range(3):
    
#     if df.iloc[i,5] >= 90:
#         df['합격'] =  '합격'
#     else:
#         df['합격'] =  '불합격'


# 쭉 만들어봐  ,, 


for i in df['평균']:
    
    if i >= 90:
        df['합격'] 

df

    수학  영어   음악   체육   총점     평균   합격
서준  90  98   85  100  373  93.25  불합격
우현  80  89   95   90  354  88.50  불합격
인아  70  95  100   90  355  88.75  불합격

In [5]:
## 답

grades = []

for row in df['평균']:
    if row >= 90:
        grades.append('합격')
    else:
        grades.append('불합격')
        
df['합격'] = grades 

df

    수학  영어   음악   체육   총점     평균   합격
서준  90  98   85  100  373  93.25   합격
우현  80  89   95   90  354  88.50  불합격
인아  70  95  100   90  355  88.75  불합격

In [93]:
for i in df['평균']:
    print(i)

93.25
88.5
88.75

In [6]:
def scholarship(row):
    print(row)
    if row == '합격':
        return '장학생'
    else:
        return '비장학생'

In [9]:
df['장학여부'] = df.합격.apply(scholarship) # apply  각각에 함수 대입

합격
불합격
불합격

In [10]:
df

    수학  영어   음악   체육   총점     평균   합격  장학여부
서준  90  98   85  100  373  93.25   합격   장학생
우현  80  89   95   90  354  88.50  불합격  비장학생
인아  70  95  100   90  355  88.75  불합격  비장학생

## 데이터 입출력